Agenda de programacion clockeada.                             [[file:~/py1local/fichaje.py][fichaje.py]]
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2016-11-08 mar 13:32]
| Headline                                      |    Time |       |
|-----------------------------------------------+---------+-------|
| *Total time*                                  | *22:26* |       |
|-----------------------------------------------+---------+-------|
| Tab pedidos                                   |   17:44 |       |
| \emsp DONE haciendo subtab pasar clientes...  |         |  1:16 |
| \emsp DONE bosquejamos el pasado de pedido    |         |  1:41 |
| \emsp DONE agregando posibilidad de carga...  |         |  1:00 |
| \emsp DONE parte logica - guardado del pedido |         |  0:32 |
| \emsp DONE poner la linea check anulado/...   |         |  0:30 |
| \emsp nuevas ideas                            |         | 11:20 |
| tab seven                                     |    0:51 |       |
| tabVentas                                     |    1:31 |       |
| \emsp verificacion bug                        |         |  0:41 |
| \emsp TODO borrado de quieren comprar         |         |  0:50 |
| Bug reaparece                                 |    2:20 |       |
| \emsp tabFechar                               |         |  0:46 |
| \emsp reviso con pycharm lado a lado          |         |  1:34 |
#+END:

* Tab pedidos                                                       :urgente:
CLOCK: [2016-10-25 mar 12:16]--[2016-10-25 mar 12:31] =>  0:15
CLOCK: [2016-10-24 lun 21:59]--[2016-10-24 lun 22:22] =>  0:23
CLOCK: [2016-10-24 lun 19:45]--[2016-10-24 lun 20:32] =>  0:47
** DONE hice una subclase de Buscar que se llama BuscarConPadron
que hereda de Buscar y redefine el metodo show, para permitir filtrar
si el usuario ingreso un dni con prefijo f/F/m/M y busca en el padron
femenino o masculino el numero, y ello sin importar si el cliente ya
existe en Romitex. (cosa que no se podia en las busqueda
semiautomaticas de dni.tcl)
** DONE Inicie el tab y puse el cuadro de Buscar en un frame
** DONE Le agregue funcionalidad de busqueda por nombre pf'Filippi Ana'
*** ojo con el elif                                                 :pitfall:
agrego un branch mas a un if elif else y no actualizo bien. y queda 
if
if
elif
else
y produce errores raros, y es que el flujo va dos veces por un if que
pretende ser excluyente.
** DONE Arregle toque final class Buscar/BuscarConPadron


Agregue o bien mejore y estableci el metodo colsel del tablelist que
te permite poner las columnas ya de entrada en la definicion del tbls
con el select que vamos a usar y no dejar que se cargue automaticamente.
** DONE haciendo subtab pasar clientes nuevos
CLOCK: [2016-10-25 mar 19:01]--[2016-10-25 mar 19:15] =>  0:14
CLOCK: [2016-10-25 mar 13:06]--[2016-10-25 mar 13:30] =>  0:24
CLOCK: [2016-10-25 mar 13:47]--[2016-10-25 mar 14:25] =>  0:38
ya esta casi listo.  Falta corregir el metodo clear de los combos de
bwidget que no andan. para el boton limpiar. Lo hice asi separado, pq
en este pasador nuevo quiero seguir el zen de python explicito mejor
que implicito.
pasado de cliente nuevo en tab aparte, que quede ahi los datos hasta
qu expresamente los limpie, etc.
Era un bug en bwidget.py, ya lo arregle pero lo mismo no limpia.
** DONE bosquejamos el pasado de pedido
CLOCK: [2016-10-29 sáb 11:29]--[2016-10-29 sáb 11:51] =>  0:22
CLOCK: [2016-10-29 sáb 11:17]--[2016-10-29 sáb 11:27] =>  0:10
CLOCK: [2016-10-28 vie 19:50]--[2016-10-28 vie 20:23] =>  0:33
dejo para despues cuando tenga mas concentracion.
Pasado de pedido: Encabezo el subtab con id y nombre del que compra y
luego vamos con los datos del pedido en si.
CLOCK: [2016-10-28 vie 11:51]--[2016-10-28 vie 12:27] =>  0:36
Done: Tanto buscando en el cuadro buscar como creando un cliente nuevo
se termina en subtab pedido con un encabezado en label rojo con el id
y nombre del cliente a procesar.
Inicio apenas el pedido.

bugs: class LabelFecha que ponga la fecha de hoy con . o h.
arreglar los tamaños de la linea.
Corregido. Estaban mal los nombres de los keysym era period y
KP_Decimal para punto y habia un error en delete(0,END,hasta) el hasta
estaba de mas.
Arreglado los tamaños a mano y agregado el campo de info seven, que
tendra que ser registrado en algun lado, lo cual no es malo, pq toda
esa data siempre se perdio y es muy relevante. .
** DONE agregando posibilidad de carga general de datos
CLOCK: [2016-10-29 sáb 12:09]--[2016-10-29 sáb 13:09] =>  1:00
ya esta hecha la linea de datos, que funciona a nivel general. Me
trabo un bug o un pitfall de labelentry con el metodo set, que ya lo
he tenido, es decir cuando asigno mediante un bind un valor a un
labelentry se ponen unos signos raros en el campo lanzador del bind y
no surte efecto el bind, yo lo atribuia en principio a que andaba mal
el teclado fisico mio, pero aca lo probe con entrys sueltos o sea sin
label entry y anda joyita o sea que eso me plantea el tema de tener
que usar esos atajos que en principio parecieron ideales y que ahora
no lo son. pq en el caso de que tengo que usar un frame horizontal, es
rapidisimo incorporar los label sueltos y el ancho se calcula solo y
mejor.
** DONE parte logica - guardado del pedido
CLOCK: [2016-10-29 sáb 20:32]--[2016-10-29 sáb 21:04] =>  0:32
guardado todos los campos en tabla pedido. No se guardan los que no
son relevantes en esta etapa p.e. fechaentrega pq suponemos como regla
de negocio que el promotor vende para entregar en lo inmediato y se
puede suponer una fecha de entrega del mismo dia o dia siguiente. 
Alli faltaria una funcion dia-habil-siguiente. TODO
Guardo la infoseven recabada en un campo agregado en tabla clientes
para uso posterior.
Puse un tbls de muestra con recalc automatico.
** DONE poner la linea check anulado/ causa anulamiento.
CLOCK: [2016-10-29 sáb 22:24]--[2016-10-29 sáb 22:54] =>  0:30
estaria listo esa parte en lo visual. faltaria la parte logica o sea
incluirlo en el guardado.
Y establecer borrado en el tbls de pedidos.
** nuevas ideas
*** DONE que la busqueda dni, empalme a padron directo
y aparte esten las ya programadas de padron f/m/pf/pm
*** DONE que haya un buffer de edicion de datos/ingreso de cliente nuevo
CLOCK: [2016-10-31 lun 12:27]--[2016-10-31 lun 12:56] =>  0:29
CLOCK: [2016-10-31 lun 11:37]--[2016-10-31 lun 12:27] =>  0:50
en el mismo set de campos

*** como se ingresaria un pedido
uno pone el dni que da el promotor, si coincide barbaro, si no
coincide lo tenes que buscar por nombre y/o direccion, para evitar
homonimos y avivados, ya ahi el viejo rx fallaba y el cuadro de
busqueda es muy potente para eso.
Pero luego no debemos quedar sin el cuadro de edicion de
datos/agregado pq es mas practico, y luego pasamos el pedido. Podemos
ver un tbls aunque sea chiquito de confirmacion de pedidos pasados,
pero en un subtab aparte tenemos todos los pedidos.
*** DONE hacer un tipo packer-linea como tenia antes
CLOCK: [2016-10-31 lun 11:00]--[2016-10-31 lun 11:37] =>  0:37
eso permitiria componer la linea mas facilmente y luego packear o
placear las lineas en si.
el codigo quedara mas compacto y sera mas facil y rapido programar.
*** Poner un cuadro de informacion resaltada en el frente a la derecha
CLOCK: [2016-10-31 lun 14:05]--[2016-10-31 lun 14:36] =>  0:31
deudor, seven, pagando, pedido rechazado, lista negra, etc. cosa de
que no sea facil pasarse por alto un moroso cuando uno pasa el pedido.
El cuadro de informacion de cliente debe asegurar que uno no se
equivoque y que pueda investigar mas si hace falta. 
Indicar p.e. si hay otros clientes en la direccion, (lo ideal seria
que tambien vea si hay morososos en direcciones cercanas).

*** DONE guardar cliente nuevo editar cliente
CLOCK: [2016-10-31 lun 21:33]--[2016-10-31 lun 22:12] =>  0:39
al apretar boton guardar define editar o crear depende si existe el
idcliente, editamos todos los datos muy facilmente y nos avisa un
balloon que ha sido editado o creado el cliente.
*** DONE mejorar el tabVer para que se pueda dirigir alli las vistas
CLOCK: [2016-11-04 vie 13:03]--[2016-11-04 vie 13:30] =>  0:27
CLOCK: [2016-11-04 vie 11:50]--[2016-11-04 vie 12:23] =>  0:33

dirige a Fechar por necesidad, tendria que arreglar la pestaña Ver
para que se pudiera ver ahi, con mas claridad. faltaria un encabezado
de busqueda individual.
Arregle un poco Ver, dandole un encabezado, pero no nos olvidemos que
Ver no tiene por el momento edicion, la edicion la hemos concentrado
en Fechar.
*** TODO varios pensados este finde
**** DONE agregar fecha de entrega
CLOCK: [2016-11-06 dom 18:02]--[2016-11-06 dom 18:58] =>  0:56
por ahora puede ser dia siguiente, lo ideal una funcion dia siguiente
habil. 
Ya hice una funcion diahabilsiguiente con feriados incluidos, solo
necesita cargar los feriados en lib.tcl.

**** DONE cuando se agrega pedidos limpiar campos, 
CLOCK: [2016-11-06 dom 19:49]--[2016-11-06 dom 20:45] =>  0:56
CLOCK: [2016-11-06 dom 19:25]--[2016-11-06 dom 19:38] =>  0:13
cambiar el check que puede activarse por error y poner el tbls de
control con el nombre del cliente tmb.

**** TODO historial de Buscar

**** DONE mejora de tbls class buscar coloreado segun situacion
CLOCK: [2016-11-08 mar 20:17]--[2016-11-08 mar 20:58] =>  0:41
y de paso mejora de Buscar o sea otros coloreados segun situacion de
deuda.
puse un campo case when, llamado mora que calcula la deuda si tiene
mas de 60 dias que no paga y lo pone en mora y va en rojo, sino va en
azul. y pongo en gris los que no compraron nunca.


*** DONE pestaña resumen de pedidos donde se pueda ver los pedidos
CLOCK: [2016-11-07 lun 12:20]--[2016-11-07 lun 12:46] =>  0:26
CLOCK: [2016-11-07 lun 12:00]--[2016-11-07 lun 12:20] =>  0:20
segun diversos criterios, todos, pendientes, entregados,
Antes en una primera parte se acomodo el tbl de Buscar para que
muestre los campos en un orden mas logico, o sea
nombre,dni,calle,num,deuda,ultpago,ultcompra
y despues zona,barrio,acla,etc. sino es poco util.
Hice una pestaña con vision de pedidos con botones a media, todos,
pendientes, anulados o entregados.
*** DONE borrado de pedido en ambos tbls
CLOCK: [2016-11-07 lun 13:06]--[2016-11-07 lun 13:15] =>  0:09
ya esta borrado para ambas tbls con el mismo proc.
*** DONE coloreado segun estado y cambio de estado con teclado
CLOCK: [2016-11-07 lun 18:26]--[2016-11-07 lun 19:34] =>  1:08
CLOCK: [2016-11-07 lun 15:10]--[2016-11-07 lun 16:03] =>  0:53
mientras tenga pasador de ventas propio, cambiar de estado rapidamente
con e o a.
Vere que se puede hacer con el coloreado con metodo resaltar para
seguir teniendo recalc, y tener mas de un resaltar.
TErminado un metodo general para colorear tbls con un metodo facil de
usar que se llama resaltado.
*** DONE replantear campos entregado/anulado/pendiente
CLOCK: [2016-11-07 lun 20:04]--[2016-11-07 lun 21:01] =>  0:57
porque es un quilombo y da muchos errores y dolores de
cabeza... reales.
Terminamos usando un solo campo el cual sirve para concentrar el
status
y permitiria en el futuro incluso ampliarla a voluntad, p.e. con el
rechazado.
que joder lo hago ahora que estoy justo en el tema.
listo tengo rechazado por el cliente en status 3.


*** DONE bug: cliente nuevo
CLOCK: [2016-11-07 lun 21:02]--[2016-11-07 lun 21:30] =>  0:28
Listo. Puse un boton nuevo. No obstante me hace ruido la posibilidad
de que yo mismo o alguien mas pueda cometer el mismo bug. Quizas no
deberia dejar que se pudiera alterar el dni, y ello trabaria la
posibilidad de  cambiar desde ese lugar de uso tan frecuente y rapido
un dato de cliente como me paso hoy.

*** DONE eliminar que se pueda cambiar el dni desde el tab pedidos
CLOCK: [2016-11-08 mar 11:39]--[2016-11-08 mar 11:54] =>  0:15
o bien poner un aviso de posible error.
Puse un flag que avisa e impide en caso de que no se conteste que si
avanzar en la edicion de un cambio de de dni.


*** DONE agregar la vista de ex-calle-exnum etc 
CLOCK: [2016-11-08 mar 13:15]--[2016-11-08 mar 13:31] =>  0:16
agregado una pestaña mas en tabVer, lo cual es un servicio extra a una
funcionalidad primitiva de la base de datos pero que nunca se programo
para verla, quedara en el futuro el ampliar alli mismo el modulo de
cambio de direcciones
*** DONE posibilidad de pasar en algun lado el resultado de seven
CLOCK: [2016-11-07 lun 13:17]--[2016-11-07 lun 13:34] =>  0:17
o del anulamiento luego de procesado el pedido, pq puede que uno lo
pase rapido y no necesariamente coincida con el control de seven.
Arregle el paso del anulado y comentario, que estaba mal, pero siendo
pedidos una tabla auxiliar (o sea no vinculante) no veo el sentido
para que se pase un pedido y luego despues de pasado se verifique en
el seven y se quiera updatear en otro lado.
o bien se van verificando en paralelo hasta la parte de los datos del
cliente que se van ingresando lo mismo o editando lo  mismo
acumulativamente y si se verifica seven, sin estar pasando el pedido,
se anota en el dato cosa que siempre hago, y luego ponele que paso el
dato anoto eso, es raro que pase el dato de una y despues vaya a
anularlo, y si pasara eso, lo borro al dato y lo paso de nuevo, borro
ventas a cada rato pq el codigo de art no me deja entrar, mira sino
voy a borrar un pedido.
 
*** TODO documento nuevo en python
*** TODO tablero de control promotores
*** TODO planilla de salida de mercaderia
alli se hara la clausula legal. Me firmaran todos los dias, en la
planilla no solo debe salir que mercaderia llevan sino que la llevan
para entregarla especificamente a dichas personas, y pondria una
clausula que diga en formato de contrato lo siguiente:
**** Los clientes destinatarios de los articulos que el vendedor lleva
han sido chequeados en funcion de la informacion traida por el
vendedor, en base a su verificacion visual del dni del cliente y se
compromete solidariamente a hacer firmar el documento a la misma
persona que genero el pedido y cuyos datos figuran en la planilla y en
el documento. En caso de no estar disponible la persona, el articulo
debe ser traido y entregado mañana. Cualquier falsedad en que incurra
la operacion no puede ser alegada como actuada por desconocimiento por
cuanto el vendedor esta expresamente encomendado a tener la precaucion
y tomar los recaudos para hacer firmar al cliente indicado que fue el
que el mismo trajo, y de cuya operacion el mismo se va a beneficiar,
resultando cualquier irregularidad un fraude directo a la empresa con
responsabilidad sobre el vendedor.
**** Las direcciones declaradas por el vendedor 
tienen el caracter de declaracion jurada y son tomadas como ciertas,
por cuanto tambien fueron informadas por el vendedor, cualquier
discrepancia debe ser corregida en el momento de la entrega. 
**** Formato de contrato
en si cuando lo explique al vendedor, le hago saber que el contrato de
entrega es un contrato aparte, que lo vincula a el en cada entrega que
hace y queda pegado a la veracidad de lo actuado con cada cliente en
particular.
Como esas hojas se guardan y de paso tienen orden puede ser
interesante para llevar un rastro de responsabilidad sobre el vendedor
de que si se manda una cagada la va a pagar el mismo, y en un contexto
en el cual no necesitamos ni queremos muchos promotores, todo pienso
que puede andar bien en ese sentido.



* tab seven
CLOCK: [2016-10-29 sáb 19:09]--[2016-10-29 sáb 19:16] =>  0:07
CLOCK: [2016-10-29 sáb 18:41]--[2016-10-29 sáb 19:08] =>  0:27
CLOCK: [2016-10-29 sáb 18:06]--[2016-10-29 sáb 18:23] =>  0:17
revision
*** tema capitalizacion del nombre. 
yo lo hice con la planilla de calculo y pretendi hacerlo dentro de
python en un toque y no fue tan facil pq no salio bien.
capitalizo la primera parte del nombre.
seria split, capitalize, con excepciones del, las la de 
unir el string de nuevo
Se hizo una funcion que es mas eficiente que la funcion de libreoffice
que no tiene en cuenta las particulas.
*** tema bug calle arce cabeza de vaca ver.
solucionado via string.replace(',',' ') o sea limpio la cadena de
calle de todos los signos que puedan interferir.
* tabVentas
** verificacion bug
CLOCK: [2016-10-31 lun 19:28]--[2016-10-31 lun 20:09] =>  0:41
Solucionado, pero -no me gusta- no encontre la causa.
Al poner el numero de dni, busca el registro y lo carga pero el campo
que tiene el bind asignado se llena o se appendea con caracteres
raros.
Yo antes pensaba que era culpa de LabelEntry, y cambie por Label y
Entrys p.e. cuando hice el sabado el codart y art en el pedido, y hoy
pensaba que era la correccion a LabelEntry y Entry1 que le habia hecho
en el metodo set para que en caso de tener un valor nulo no diera
error (cosa que tambien esta muy en el aire y sin probar pero
permitio que siguiera adelante). 
La realidad es que el fallo proviene del campo que tiene un bind,
funciona el bind y deja los caracteres, que son unicode
incomprensibles segun el error de python.
Hice un parentesis para probar si era el problema que el bind agregaba
un caracter extra y debia ponerse break, o evitar el bind de evento
virtual, y nada, ni con <Return> puro, ni con break obtengo otro
resultado.
Lo real que levanto el registro, o sea que en el momento de gatillar
el bind, el valor del campo es correcto, pero luego se corrompe o se
le agrega unos caracteres malos, que aca no se ven, pero en la ofi si
se ven.
El workaround que tuve aca fue recargar el valor del campo, luego de
levantado, o sea hacer de nuevo p.e. dni.set(cliente['dni']) y
entonces tenemos el campo restaurado y listo para que el proceso siga.

Lo raro de todo es que fichitas funcionaba bien la semana pasada, y en
ofi pase un monton de fichitas. Y recien el sabado se manifesto este
problema.
Y no puede ser una actualizacion de tkinter pq aca la puedo haber
hecho pero en oficina no actualice nada y alla se  manifesto hoy el
problema.
Da para estudiarlo en el futuro.
** DONE borrado de quieren comprar
CLOCK: [2016-11-07 lun 13:39]--[2016-11-07 lun 14:29] =>  0:50
pq puede darse que me arrepienta de haberlo pasado.
Hecho: agregue borrado de quieren comprar, con linkeado a tabla
clientes, y doble click abre ficha en tabFechar.
** TODO fichita de pedidos diferenciada y con leyenda
a pedido del vendedor

* tabVer
** info verificacion seven
como una info mas que usualmente se carga durante un pedido pero se
puede cargar en otro momento.

* Bug reaparece
** tabFechar
CLOCK: [2016-11-01 mar 20:46]--[2016-11-01 mar 21:32] =>  0:46
Habria que revisar con gitlab, linea por linea para atras lo que pueda
haber afectado el enter en los campos con bind pq esto antes no
estaba.
Podria llegar a ser que los campos, no importa que sean entry o
labelentry esten bindeados con return (o el virtual enter). Siendo que
estan biendeados como all para movimiento, y en cambio cuando los
bindie con focusout anduvo. veamos.

Cuando pensaba que estaba solucionado me aparece un nuevo twist.
lo pruebo en el ejemplo anterior, y anda bien, pero me corrompe el
campo siguiente, en este caso el nombre.

Pueden ser muchas cosas, ahora lo vamos aislando y sospechando de los
bind de paso de campo, pero porque no se manifestaron antes, que los
hizo aparecer ahora.

Lo altamente sospechoso ahora es como si me internara en un juego de
terror, es que anulando los bind de paso de campo el bug sigue igual y
se manifiesta en el campo siguiente con focusout.

Es tan raro que me hace sospechar del teclado, pero en tal caso
andaria mal orgmode y emacs y todo.

Revisaremos todo mañana cuando no este tan cansado.
** reviso con pycharm lado a lado
CLOCK: [2016-11-03 jue 20:49]--[2016-11-03 jue 21:47] =>  0:58
CLOCK: [2016-11-03 jue 13:43]--[2016-11-03 jue 14:19] =>  0:36

revisando parte que anda parte por parte
*** padron femenino/masculino
nada por el momento
*** No entiendo nada. nada. nada.
quiero ver que archivo lib.py esta tomando y los borro a todos, y los
cambio de nombre y el archivo sigue arrancando como si nada.
Este bug me esta consternando. Es una lastima porque venia bien y me
esta cansando, me esta agotando.
Ya no me gusta nada.
*** parece nomas que el problema es con lib.py
Despues de procesar todo, e ir agregando parte por parte y probando
todo, se obtiene que nada es diferente.
Y que la unica posibilidad es que python se deje llevar por el cache y
alli algo se corrompa en un momento y por mas que el archivo este
bien, nada parece andar.
Abria que borrar el cache. Investigar si despues se puede andar sin
cache.







* TODO Generales
** Mejorar o bien cambiar los combos de bwidget
en especial el tema focusnext con enter. y busqueda case insensitive
* Modulos futuros
** modulo de cambios de direcciones con tabla aparte
** modulo de devoluciones de articulos
** modulo de atencion de avisos y esquemas de promocion
